# RenderRpcProperties Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..RenderRpcProperties Property
ParameterTypeId Class See Also
---
"Render Appearance Properties"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId RenderRpcProperties { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property RenderRpcProperties As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ RenderRpcProperties {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace